/* eslint-disable */
import {
    OBJECTS_REQUEST,
    OBJECTS_ERROR,
    OBJECTS_SUCCESS,
} from "../actions/objects";


const defaultState = () => {
    return {
        types: [
            {
                id: 1,
                name: 'ТЭЦ',
                color: '#00cae3',
                icon: `<svg id="bold" fill="currentColor" enable-background="new 0 0 24 24" height="512" viewBox="0 0 24 24" width="512" xmlns="http://www.w3.org/2000/svg"><path d="m13.25 7h-9.5c-.414 0-.75.336-.75.75v1.5c0 .414.336.75.75.75h9.5c.414 0 .75-.336.75-.75v-1.5c0-.414-.336-.75-.75-.75z"/><path d="m17.854 0c-.818 0-1.597.311-2.175.845-.994-.605-2.411-.463-3.252.309-.749-.393-1.762-.302-2.429.224-1.035-.193-1.998.619-1.998 1.622s.962 1.819 1.998 1.623c.667.525 1.681.616 2.429.224.841.772 2.258.913 3.252.309.578.533 1.357.844 2.175.844 1.735 0 3.146-1.346 3.146-3s-1.411-3-3.146-3z"/><path d="m16.926 23.238c-.035-.057-3.153-5.219-3.801-12.238h-9.25c-.114 1.231-.307 2.4-.543 3.5h3.918c.414 0 .75.336.75.75s-.336.75-.75.75h-4.277c-.139.524-.287 1.022-.439 1.5h4.716c.414 0 .75.336.75.75s-.336.75-.75.75h-5.229c-.966 2.606-1.928 4.207-1.947 4.238-.205.335.037.762.426.762h16c.391 0 .63-.43.426-.762z"/><path d="m23.5 11h-9c-.138 0-.262.056-.352.145.668 6.6 3.584 11.493 3.631 11.57.239.39.273.861.122 1.284h5.599c.276 0 .5-.224.5-.5v-12c0-.275-.224-.499-.5-.499zm-3.25 10h-2.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h2.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-2.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h2.5c.414 0 .75.336.75.75s-.336.75-.75.75zm0-3h-2.5c-.414 0-.75-.336-.75-.75s.336-.75.75-.75h2.5c.414 0 .75.336.75.75s-.336.75-.75.75z"/></svg>`,
                notice: 'Данные за последние 24 часа',
                value: 7
            },
            {
                id: 2,
                name: 'ТЭС',
                color: '#e91e63',
                icon: `<svg id="factory2" fill="currentColor" enable-background="new 0 0 511.226 511.226" height="512" viewBox="0 0 511.226 511.226" width="512" xmlns="http://www.w3.org/2000/svg"><g><path d="m25.178 195.613-25.178 314.72h147.796l-33.57-314.72z"/><path d="m31.178 120.613-3.6 45h83.448l-4.8-45z"/><path d="m470.156 210.613-80.337 97.121v-97.121h-41.044l-84.685 101.797v-101.797h-41.087l-68.178 82.762 10.372 97.238h46.029v30h-42.829l9.6 90h333.229v-300zm-168.93 210h-60v-30h60zm90 0h-60v-30h60zm90 0h-60v-30h60z"/><path d="m133.196 90.613 10.099 94.679c15.558-1.388 30.38-7.317 42.579-16.962 13.696 7.981 29.403 12.283 45.351 12.283 24.818 0 48.319-10.251 65.181-27.959 10.783 5.236 22.605 7.959 34.819 7.959 17.581 0 34.645-5.858 48.486-16.39 11.564 7.41 25.024 11.39 39.014 11.39 39.977 0 72.5-32.523 72.5-72.5s-32.523-72.5-72.5-72.5c-12.471 0-24.67 3.229-35.428 9.258-14.39-12.363-32.752-19.258-52.072-19.258-17.536 0-34.544 5.82-48.36 16.291-15.044-10.581-32.949-16.291-51.64-16.291-25.879 0-50.145 11.03-67.101 30.027-8.891-3.31-18.349-5.027-27.899-5.027-38.984 0-71.526 28.036-78.569 65z"/></g></svg>`,
                notice: 'Данные за последние 24 часа',
                value: 15
            },
            {
                id: 3,
                name: 'Цементный завод',
                color: '#ff9800',
                icon: `<svg height="512pt" fill="currentColor" viewBox="0 -32 512 512" width="512pt" xmlns="http://www.w3.org/2000/svg"><path d="m512 255.8125v-30h-25.066406l-17.023438-195.8125h16.089844v-30h-131.230469v30h16.089844l-17.023437 195.8125h-14.992188l-16.078125-135.808594h15.570313v-30h-131.230469v30h15.570312l-16.078125 135.808594h-13.429687v-57.773438l-193.167969 75.578126 10.949219 27.933593 13.050781-4.957031v150.71875h-24v30h512v-30h-24v-161.5zm-342.976562 160.585938h-30v-99.847657h-30.46875v99.847657h-30v-129.847657h90.46875zm129.152343-41.125h-89.597656v-30h89.597656zm0-60.003907h-89.597656v-30h89.597656zm120.007813 60.003907h-89.597656v-30h89.597656zm0-60.003907h-89.597656v-30h89.597656zm0 0"/></svg>`,
                notice: 'Данные за последние 24 часа',
                value: 38
            },
            {
                id: 5,
                name: 'Металлургия',
                color: '#5d297a',
                icon: `<svg id="steel" fill="currentColor" enable-background="new 0 0 512 512" height="512" viewBox="0 0 512 512" width="512" xmlns="http://www.w3.org/2000/svg"><g><path d="m197 60h205c8.271 0 15 6.729 15 15v30c0 8.284 6.716 15 15 15s15-6.716 15-15v-30c0-24.813-20.187-45-45-45h-205c-8.271 0-15-6.729-15-15 0-8.284-6.716-15-15-15s-15 6.716-15 15c0 24.813 20.187 45 45 45z"/><path d="m137 120h155c8.284 0 15-6.716 15-15s-6.716-15-15-15h-155c-8.271 0-15-6.729-15-15 0-8.284-6.716-15-15-15s-15 6.716-15 15c0 24.813 20.187 45 45 45z"/><path d="m167 197h-152c-8.284 0-15 6.716-15 15v285c0 8.284 6.716 15 15 15h31v-95c0-8.284 6.716-15 15-15h60c8.284 0 15 6.716 15 15v95h46v-300c0-8.284-6.716-15-15-15zm-91 160c0 8.284-6.716 15-15 15s-15-6.716-15-15v-20c0-8.284 6.716-15 15-15s15 6.716 15 15zm0-80c0 8.284-6.716 15-15 15s-15-6.716-15-15v-20c0-8.284 6.716-15 15-15s15 6.716 15 15zm60 80c0 8.284-6.716 15-15 15s-15-6.716-15-15v-20c0-8.284 6.716-15 15-15s15 6.716 15 15zm0-80c0 8.284-6.716 15-15 15s-15-6.716-15-15v-20c0-8.284 6.716-15 15-15s15 6.716 15 15z"/><path d="m76 432h30v80h-30z"/><path d="m309.5 142h-35c-7.565 0-13.946 5.633-14.884 13.14l-16.483 131.86h97.734l-16.483-131.86c-.938-7.507-7.319-13.14-14.884-13.14z"/><path d="m399.616 155.14-16.483 131.86h97.734l-16.483-131.86c-.938-7.507-7.319-13.14-14.884-13.14h-35c-7.565 0-13.946 5.633-14.884 13.14z"/><path d="m497 317h-285v195h65v-75c0-8.284 6.716-15 15-15h140c8.284 0 15 6.716 15 15v75h50c8.284 0 15-6.716 15-15v-165c0-8.284-6.716-15-15-15zm-205 75h-20c-8.284 0-15-6.716-15-15s6.716-15 15-15h20c8.284 0 15 6.716 15 15s-6.716 15-15 15zm80 0h-20c-8.284 0-15-6.716-15-15s6.716-15 15-15h20c8.284 0 15 6.716 15 15s-6.716 15-15 15zm80 0h-20c-8.284 0-15-6.716-15-15s6.716-15 15-15h20c8.284 0 15 6.716 15 15s-6.716 15-15 15z"/><path d="m307 452h110v60h-110z"/></g></svg>`,
                notice: 'Данные за последние 24 часа',
                value: 5
            },
        ],
        objects: [
            {
                "id": 1,
                "title": "Ладыжинская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "Снєгін Ігор Петрович",
                "address": "ул. Наконечного",
                "latitude": 48.706098,
                "longitude": 29.219872,
                "width": 0,
                "height": 0,
                "phones": "(043)4365387",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "672 км. "
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "660 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "463 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "572 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "632 км."
                    }
                ],
                "region": "UA-05",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 2,
                "title": "Приднепровская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "БОРИЧЕВСЬКИЙ АНАТОЛІЙ МИХАЙЛОВИЧ",
                "address": "ул. Гаванская, 1",
                "latitude": 48.405699,
                "longitude": 35.112105,
                "width": 0,
                "height": 0,
                "phones": "380567189350",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "670 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "692 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "778 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "904 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1055 км."
                    }
                ],
                "region": "UA-12",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 3,
                "title": "ТЕХНО-ПРОМ-ИМПУЛЬС",
                "owner": "КИСЕЛЬОВ ДМИТРО МИКОЛАЙОВИЧ",
                "person": "КИСЕЛЬОВ ДМИТРО МИКОЛАЙОВИЧ",
                "address": "ул. Крылова коммисара, 14",
                "latitude": 48.48283,
                "longitude": 35.102873,
                "width": 0,
                "height": 0,
                "phones": "380509799993",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "661 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "685 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "771 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "897 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1048 км."
                    }
                ],
                "region": "UA-12",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 4,
                "title": "УКРСПЕЦЦЕМЕНТ (Прекращено)",
                "owner": "СЕРБІНЕНКО ЄВГЕНІЙ ВІТАЛІЙОВИЧ",
                "person": "СЕРБІНЕНКО ЄВГЕНІЙ ВІТАЛІЙОВИЧ",
                "address": "пл. Ленина, 1",
                "latitude": 48.463948,
                "longitude": 35.046306,
                "width": 0,
                "height": 0,
                "phones": "",
                "railways": 0,
                "destinations": [],
                "region": "UA-12",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 5,
                "title": "ЦЕМЕНТ-ИНВЕСТ",
                "owner": "КІНЦЕВИЙ БЕНЕФІЦІАРНИЙ ВЛАСНИК (КОНТРОЛЕР) ВІДСУТНІЙ У ЗВ'ЯЗКУ З НЕМОЖЛИВІСТЮ РОЗКРИТТЯ КОНФІДЕНЦІЙНОЇ ІНФОРМАЦІЇ ПРО НЕРЕЗИДЕНТА",
                "person": "ІГНАТЬЄВ ЄВГЕН ВОЛОДИМИРОВИЧ",
                "address": "просп. Труда, 6",
                "latitude": 48.410005,
                "longitude": 35.036072,
                "width": 0,
                "height": 0,
                "phones": "380567160353",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "674 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "695 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "776 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "902 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1053 км."
                    }
                ],
                "region": "UA-12",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 6,
                "title": "Криворожская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "Дегтяренко Сергей Михайлович",
                "address": "пл. Энергетиков, 1",
                "latitude": 47.543998,
                "longitude": 33.657901,
                "width": 0,
                "height": 0,
                "phones": "",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "610 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "686 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "738 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "864 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1015 км."
                    }
                ],
                "region": "UA-12",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 7,
                "title": "УКРЦЕМЕНТ",
                "owner": "КІНЦЕВИЙ БЕНЕФІЦІАРНИЙ ВЛАСНИК ВІДСУТНІЙ",
                "person": "СКІЛЬСЬКИЙ РОМАН ВОЛОДИМИРОВИЧ",
                "address": "ул. Спортивная, 36",
                "latitude": 48.513801,
                "longitude": 34.59948,
                "width": 0,
                "height": 0,
                "phones": "5177180",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "643 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "669 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "733 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "859 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1010 км."
                    }
                ],
                "region": "UA-12",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 8,
                "title": "КРИВОЙ РОГ ЦЕМЕНТ",
                "owner": "ШЕСТАК ІВАН МИКОЛАЙОВИЧ",
                "person": "ЗАВІНОВСЬКИЙ ІГОР СТАНІСЛАВОВИЧ",
                "address": "ул. Тритузная, 37",
                "latitude": 48.5251454,
                "longitude": 34.5828313,
                "width": 0,
                "height": 0,
                "phones": "380562387500, 380562387501",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "638 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "641 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "698 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "817 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "968 км."
                    }
                ],
                "region": "UA-12",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 9,
                "title": "ДНЕПРОПЕТРОВСКИЙ ЦЕМЕНТНЫЙ ЗАВОД",
                "owner": "КАРПЕНКО МИХАЙЛО МИХАЙЛОВИЧ",
                "person": "ТКАЧУК ГАЛИНА ОЛЕКСАНДРІВНА",
                "address": "ул. Ударников 42м",
                "latitude": 48.479811,
                "longitude": 34.992057,
                "width": 0,
                "height": 0,
                "phones": "38(068)42034203",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "669 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "693 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "764 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "886 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1040 км."
                    }
                ],
                "region": "UA-12",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 10,
                "title": "ПРОМЦЕМЕНТ",
                "owner": "НАКОНЕЧНИЙ ТАРАС СТЕПАНОВИЧ (СОЮЗПРОМИНВЕСТДОНБАС)",
                "person": "ДОБРЯНСЬКИЙ АНДРІЙ АНАТОЛІЙОВИЧ",
                "address": "ул. Заводская, 1",
                "latitude": 47.801806,
                "longitude": 38.488535,
                "width": 0,
                "height": 0,
                "phones": "80623459230",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "847 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "909 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "1017 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1143 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1296 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 11,
                "title": "Донецкий металлургический завод",
                "owner": "КІНЦЕВИЙ БЕНЕФІЦІАРНИЙ ВЛАСНИК ВІДСУТНІЙ",
                "person": "Салєєв Ільдар Азізюляєвич",
                "address": "вулиця Челюскінців, 174, Донецьк, Донецька область, 83000",
                "latitude": 47.9898451,
                "longitude": 37.7917014,
                "width": 0,
                "height": 0,
                "phones": "(06239)205-00",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "807 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "856 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "964 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1090 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1243 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 5,
                    "name": "Металлургия",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 12,
                "title": "МССС",
                "owner": "ЛІСУН ОЛЕГ АНАТОЛІЙОВИЧ",
                "person": "ЛІСУН ОЛЕГ АНАТОЛІЙОВИЧ",
                "address": "просп. Мира, 15, оф. 72",
                "latitude": 48.016865,
                "longitude": 37.810656,
                "width": 0,
                "height": 0,
                "phones": "(062)3048147",
                "railways": 0,
                "destinations": [],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 13,
                "title": "СТРОМАЦЕМЕНТ",
                "owner": "Фізичні і Юридичні особи",
                "person": "ДРОНОВА ВАЛЕНТИНА ОЛЕГІВНА",
                "address": "ул. Хирургическая, 22а",
                "latitude": 48.003351,
                "longitude": 37.761051,
                "width": 0,
                "height": 0,
                "phones": "80625922010",
                "railways": 0,
                "destinations": [],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 14,
                "title": "Енакиевский металлургический завод",
                "owner": "Ахметов Рінат Леонідович",
                "person": "Зайцева Тетяна Вікторівна",
                "address": "",
                "latitude": 48.2222307,
                "longitude": 38.2263384,
                "width": 0,
                "height": 0,
                "phones": "(0625)29-23-01",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "800 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "864 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "976 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1102 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1255 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 5,
                    "name": "Металлургия",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 15,
                "title": "ЦЕМЕНТ ДОНБАССА (Прекращено)",
                "owner": "\"СИ-БИ-АР ПОРТЛАНД Б.В.\"",
                "person": "ІВАНОВ ВОЛОДИМИР МИКОЛАЙОВИЧ",
                "address": "ул. Марата, 1",
                "latitude": 48.229103,
                "longitude": 38.227679,
                "width": 0,
                "height": 0,
                "phones": "",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "793 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "864 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "976 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1102 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1255 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 16,
                "title": "Зуевская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "Данилюк Иван Павлович",
                "address": "ул. 60 лет Октября, 100",
                "latitude": 48.017838,
                "longitude": 38.256741,
                "width": 0,
                "height": 0,
                "phones": "(06245) 97619, (06245) 97521",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "800 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "906 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "1014 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1140 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1293 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 17,
                "title": "Зуевская экспериментальная ТЭЦ, \"ЗуГРЭС-1\"(в состоянии прекращения в ведомости ЕДРПОУ на 31.08.2020)",
                "owner": "МІНІСТЕРСТВО ЕНЕРГЕТИКИ ТА ВУГІЛЬНОЇ ПРОМИСЛОВОСТІ УКРАЇНИ",
                "person": "Сучков Алексей Анатольевич",
                "address": "ул. Станционная, 1",
                "latitude": 48.0166381,
                "longitude": 38.2578095,
                "width": 0,
                "height": 0,
                "phones": "(06257) 40390, (+380-57) 728-29-29",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "803 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "865 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "973 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1099 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1252 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 1,
                    "name": "ТЭЦ",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 18,
                "title": "Цемент Донбасса (город Енакиево)",
                "owner": "",
                "person": "",
                "address": "ул.12 Декабря",
                "latitude": 47.8327849,
                "longitude": 38.4745028,
                "width": 0,
                "height": 0,
                "phones": "",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "847 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "909 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "1017 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1143 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1296 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 19,
                "title": "Старобешевская ТЭС",
                "owner": "РП \"Энергия Донбасса\"",
                "person": "Бекеров Валерий Аметович (и.о.директора)",
                "address": "ул. Энергетическая",
                "latitude": 47.799443,
                "longitude": 38.005891,
                "width": 0,
                "height": 0,
                "phones": "38 (071) 314-55-03, 38 (062) 537-73-59",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "834 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "885 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "993 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1119 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1272 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 20,
                "title": "Донцемент (Прекращено)",
                "owner": "ЮРИДИЧНІ ОСОБИ-АКЦІОНЕРИ",
                "person": "ЛИСЕНКО СТАНІСЛАВ ВОЛОДИМИРОВИЧ",
                "address": "ул.12 Декабря, 14",
                "latitude": 47.8018424,
                "longitude": 38.4691887,
                "width": 0,
                "height": 0,
                "phones": "825922518, 825922560",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "847 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "909 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "1017 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1143 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1296 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 21,
                "title": "Краматорский металлургический завод имени Куйбышева",
                "owner": "КРАМАТОРСЬКИЙ МЕТАЛУРГІЙНИЙ ЗАВОД ІМЕНІ КУЙБИШЕВА визнаний банкротом від 24.09.2013 № 5006/5/24б/2012 Господарський суд Донецької області",
                "person": "МАНЦОВ МИХАЙЛО ВАСИЛЬОВИЧ",
                "address": "",
                "latitude": 48.7348443,
                "longitude": 37.54761,
                "width": 0,
                "height": 0,
                "phones": "",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "704 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "775 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "883 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1009 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1162 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 5,
                    "name": "Металлургия",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 22,
                "title": "КРАМАТОРСКИЙ ЦЕМЕНТНЫЙ ЗАВОД-ПУШКА",
                "owner": "ФІЛАРЕТОС КАЛЬЦИДІС",
                "person": "ГОРГОЛЮК ВІТАЛІЙ ВІКЕНТІЙОВИЧ",
                "address": "ул. Привокзальная, 2",
                "latitude": 48.7189766,
                "longitude": 37.5418685,
                "width": 0,
                "height": 0,
                "phones": "(062)2103431",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "706 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "775 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "883 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1009 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1162 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 23,
                "title": "Кураховская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "Валантір Станіслав Миколайович",
                "address": "ул. Энергетиков, 34",
                "latitude": 47.994241,
                "longitude": 37.244801,
                "width": 0,
                "height": 0,
                "phones": "(062)7835359",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "780 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "821 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "929 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1055 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1208 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 24,
                "title": "Мариупольский металлургический комбинат имени Ильича",
                "owner": "Ахметов Рінат Леонідович (Metinvest B.v.)",
                "person": "Шевченко Тарас Григорьевич",
                "address": "",
                "latitude": 47.1395084,
                "longitude": 37.5920986,
                "width": 0,
                "height": 0,
                "phones": "(0629)56-40-09",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "917 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "958 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "235 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "259 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "415 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 5,
                    "name": "Металлургия",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 25,
                "title": "Металлургический комбинат «Азовсталь»",
                "owner": "Ахметов Рінат Леонідович (Metinvest B.v.)",
                "person": "ЦКІТІШВІЛІ ЕНВЕР ОМАРОВИЧ",
                "address": "",
                "latitude": 47.1017562,
                "longitude": 37.575577,
                "width": 0,
                "height": 0,
                "phones": "(0629)46-79-55",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "926 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "967 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "1075 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1201 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1354 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 5,
                    "name": "Металлургия",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 26,
                "title": "СЛ-ЦЕМЕНТ",
                "owner": "ШВАЛЕВА АНТОНІНА ТИМОФІЇВНА",
                "person": "ШВАЛЕВА АНТОНІНА ТИМОФІЇВНА",
                "address": "ул. Зелинского, 98",
                "latitude": 47.102504,
                "longitude": 37.516826,
                "width": 0,
                "height": 0,
                "phones": "80676280925",
                "railways": 0,
                "destinations": [],
                "region": "UA-14",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 27,
                "title": "Славянская ТЭС",
                "owner": "БЕНШ РОБЕРТ ДЖОЗЕФ (ПАТ \"ДОНБАСЕНЕРГО\")",
                "person": "Валерий Черепий",
                "address": "ул. Сечевых Стрельцов, д. 9",
                "latitude": 48.871352,
                "longitude": 37.764788,
                "width": 0,
                "height": 0,
                "phones": "38(06262) 4-91-43, 4-93-51",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "697 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "777 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "885 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1011 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1164 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 28,
                "title": "Мироновская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "Згінник Олександр Іванович",
                "address": "ул. Мира, 43",
                "latitude": 48.479541,
                "longitude": 38.285608,
                "width": 0,
                "height": 0,
                "phones": "380501302533",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "767 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "829 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "972 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1098 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1251 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 29,
                "title": "Углегорская ТЭС",
                "owner": "Корчинський Олександр Сигізмундович (ПАТ \"ЦЕНТРЕНЕРГО\")",
                "person": "ТАРУТІН СЕРГІЙ ГЕОРГІЙОВИЧ",
                "address": "",
                "latitude": 48.463008,
                "longitude": 38.2025,
                "width": 0,
                "height": 0,
                "phones": "",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "780 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "1241 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "962 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1089 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1241 км."
                    }
                ],
                "region": "UA-14",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 30,
                "title": "Запорожская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "ШОВГЕЛЯ СЕРГІЙ ВОЛОДИМИРОВИЧ",
                "address": "ул. Промышленная, 95",
                "latitude": 47.506496,
                "longitude": 34.632602,
                "width": 0,
                "height": 0,
                "phones": "(061)3932756, (061)3931546",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "893 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "917 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "988 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1114 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1265 км."
                    }
                ],
                "region": "UA-23",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 31,
                "title": "Калушская ТЭЦ-НОВАЯ",
                "owner": "МІНІСТЕРСТВО ЕНЕРГЕТИКИ УКРАЇНИ",
                "person": "Гельнер Богдан Володимирович (в.о.директора)",
                "address": "ул. Промышленная, 1",
                "latitude": 49.071111,
                "longitude": 24.319167,
                "width": 0,
                "height": 0,
                "phones": "38(034)-727-89-11",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "865 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "856 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "621 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "488 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "404 км."
                    }
                ],
                "region": "UA-26",
                "type": {
                    "id": 1,
                    "name": "ТЭЦ",
                    "color": "#113aa3",
                    "icon": "images/logo.svg"
                }
            },
            {
                "id": 32,
                "title": "ГАЛИЧЦЕМЕНТ",
                "owner": "КРУЦЬ МИКОЛА ФЕДОРОВИЧ",
                "person": "МАКОВІЙЧУК МИКОЛА ВАСИЛЬОВИЧ",
                "address": "ул. Железнодорожная, 1а",
                "latitude": 49.082982,
                "longitude": 24.790677,
                "width": 0,
                "height": 0,
                "phones": "(0342) 583709, (0342) 583764",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "835 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "826 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "591 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "488 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "382 км."
                    }
                ],
                "region": "UA-26",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 33,
                "title": "Бурштынская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "Шувар Андрій Йосипович",
                "address": "Н09",
                "latitude": 49.208618,
                "longitude": 24.667257,
                "width": 0,
                "height": 0,
                "phones": "8032257205",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "795 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "786 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "551 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "453 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "364 км."
                    }
                ],
                "region": "UA-26",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 34,
                "title": "ИВАНО-ФРАНКОВСКЦЕМЕНТ",
                "owner": "КРУЦЬ МИКОЛА ФЕДОРОВИЧ",
                "person": "КРУЦЬ МИКОЛА ФЕДОРОВИЧ",
                "address": "станция Ямница",
                "latitude": 48.9753334,
                "longitude": 24.7121088,
                "width": 0,
                "height": 0,
                "phones": "80342583717, 80342583763",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "828 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "819 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "584 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "481 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "397км."
                    }
                ],
                "region": "UA-26",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 35,
                "title": "Дарницкая ТЭЦ (ТОВ ЕВРО-РЕКОНСТРУКЦИЯ)",
                "owner": "ШКРІБЛЯК АНАТОЛІЙ ВАСИЛЬОВИЧ",
                "person": "СЕЛІВАНОВ В'ЯЧЕСЛАВ ВОЛОДИМИРОВИЧ",
                "address": "ул. Гната Хоткевича, 20",
                "latitude": 50.446834,
                "longitude": 30.642504,
                "width": 0,
                "height": 0,
                "phones": "(044)2210874",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "331 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "267 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "252 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "378 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "531 км."
                    }
                ],
                "region": "UA-30",
                "type": {
                    "id": 1,
                    "name": "ТЭЦ",
                    "color": "#113aa3",
                    "icon": "images/logo.svg"
                }
            },
            {
                "id": 36,
                "title": "ЭКОЦЕМ, ООО",
                "owner": "ЩЕРБАТЮК МИХАЙЛО АНАТОЛІЙОВИЧ",
                "person": "ЩЕРБАТЮК МИХАЙЛО АНАТОЛІЙОВИЧ",
                "address": "ул. Мазепы, 3б, оф. 197",
                "latitude": 50.443415,
                "longitude": 30.546993,
                "width": 0,
                "height": 0,
                "phones": "(044) 5990201",
                "railways": 0,
                "destinations": [],
                "region": "UA-30",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 37,
                "title": "АВ ПОЛИМЕР ГРУПП",
                "owner": "СКРИПНИК ВАЛЕНТИН ПЕТРОВИЧ, ЯКОВЛЕВ ВОЛОДИМИР БОРИСОВИЧ",
                "person": "ЯКОВЛЕВ ВОЛОДИМИР БОРИСОВИЧ",
                "address": "просп. Леся Курбаса, 13а",
                "latitude": 50.425528,
                "longitude": 30.373776,
                "width": 0,
                "height": 0,
                "phones": "(044) 3536810",
                "railways": 0,
                "destinations": [],
                "region": "UA-30",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 38,
                "title": "АВС-ГРУПП",
                "owner": "ЗАКРЕВСЬКИЙ АНДРІЙ ВАЛЕРІЙОВИЧ, ПЕТРИШИН ОЛЕГ ГРИГОРОВИЧ(ТОВ ИЗОБУД-ТРЕЙД)",
                "person": "ПЕТРИШИН ОЛЕГ ГРИГОРОВИЧ",
                "address": "ул. Луговая, 9",
                "latitude": 50.386578,
                "longitude": 30.45167,
                "width": 0,
                "height": 0,
                "phones": "(044) 5373730",
                "railways": 0,
                "destinations": [],
                "region": "UA-30",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 39,
                "title": "АРКТУР ПРИМ, ТОВ",
                "owner": "ГАВРИЛОВ ЯРОСЛАВ СЕРГІЙОВИЧ, МАЗУРОК ПАВЛО СТЕПАНОВИЧ",
                "person": "МАЗУРОК ПАВЛО СТЕПАНОВИЧ",
                "address": "просп. Палладина, 34",
                "latitude": 50.467079,
                "longitude": 30.356984,
                "width": 0,
                "height": 0,
                "phones": "(044) 4514509",
                "railways": 0,
                "destinations": [],
                "region": "UA-30",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 40,
                "title": "ВОСТОКЦЕМПРОМ",
                "owner": "БУЧАКА ВАСИЛЬ ІВАНОВИЧ, БУЧАКА КАТЕРИНА АНАТОЛІЇВНА",
                "person": "Бучака Екатерина Анатольевна",
                "address": "ул. Радужная, 6",
                "latitude": 50.491859,
                "longitude": 30.5837,
                "width": 0,
                "height": 0,
                "phones": "(044) 5015469, (067) 5069449 (контактная информация)",
                "railways": 0,
                "destinations": [],
                "region": "UA-30",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 41,
                "title": "ЕВРО СТАНДАРТ 69",
                "owner": "КАШУК АНАТОЛІЙ МИКОЛАЙОВИЧ",
                "person": "КАШУК АНАТОЛІЙ МИКОЛАЙОВИЧ",
                "address": "ул. Богатырская, 11",
                "latitude": 50.52283,
                "longitude": 30.4792585,
                "width": 0,
                "height": 0,
                "phones": "(044) 2273384",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "349 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "285 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "235 км"
                    },
                    {
                        "name": "Удрицк",
                        "distance": "361 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "514 км."
                    }
                ],
                "region": "UA-30",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 42,
                "title": "Трипольская ТЭС",
                "owner": "Корчинський Олександр Сигізмундович (ПАТ \"ЦЕНТРЕНЕРГО\")",
                "person": "Кравец Петр Павлович",
                "address": "ул. Промышленная",
                "latitude": 50.134145,
                "longitude": 30.751743,
                "width": 0,
                "height": 0,
                "phones": "(04572) 55273",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "379 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "315 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "282 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "408 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "561 км."
                    }
                ],
                "region": "UA-32",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 43,
                "title": "АГРО-ГАРАНТ-САХАР (прекращена в ведомости ЕДРПОУ на 31.08.2020)",
                "owner": "АПОСТОЛОВ ВОЛОДИМИР СЕРГІЙОВИЧ, ЛАПА ЮРІЙ ЙОСИПОВИЧ, КОВАЛЕНКО ЮРІЙ КИМОВИЧ",
                "person": "Саенко Владимир Владимирович",
                "address": "ул. Комарова, 64",
                "latitude": 48.493657,
                "longitude": 32.238124,
                "width": 0,
                "height": 0,
                "phones": "(0522) 361037",
                "railways": 0,
                "destinations": [],
                "region": "UA-35",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 44,
                "title": "СВЕТЛОВОДСКИЙ ЗАВОД СИЛИКАТНЫХ ИЗДЕЛИЙ",
                "owner": "ДМИТРІЄВ ІГОР ЮРІЙОВИЧ, ШКРЕБЕЦЬ ЄВГЕНІЙ ФЕДОРОВИЧ",
                "person": "Климашевский Александр Борисович",
                "address": "Кременчугское шоссе 1",
                "latitude": 49.049684,
                "longitude": 33.228469,
                "width": 0,
                "height": 0,
                "phones": "(05236) 22616, (05236) 21675, (05236) 21673",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "448 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "467 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "575 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "698 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "854 км."
                    }
                ],
                "region": "UA-35",
                "type": {
                    "id": 2,
                    "name": "Завод селикатных изделий",
                    "color": "#d81e1e",
                    "icon": "images/f26a9cc7af5aaf6987093cb1779fbf70.svg"
                }
            },
            {
                "id": 45,
                "title": "Луганская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "САФОНОВ БОРИС ДМИТРОВИЧ",
                "address": "ул. Гагарина",
                "latitude": 48.748571,
                "longitude": 39.261028,
                "width": 0,
                "height": 0,
                "phones": "380642965207",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "780 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "860 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "1033 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "1192 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1350 км."
                    }
                ],
                "region": "UA-09",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 46,
                "title": "«МИКОЛАЇВЦЕМЕНТ»",
                "owner": "КІНЦЕВИЙ БЕНЕФІЦІАРНИЙ ВЛАСНИК (КОНТРОЛЕР)-У ЮРИДИЧНОЇ ОСОБИ ВІДСУТНІЙ, КІНЦЕВИЙ БЕНЕФІЦІАРНИЙ ВЛАСНИК (КОНТРОЛЕР) В УЧАСНИКА (ЗАСНОВНИКА) ЮРИДИЧНОЇ ОСОБИ, ЯКЩО УЧАСНИК (ЗАСНОВНИК)-ЮРИДИЧНА ОСОБА, ВІДСУТНІЙ.",
                "person": "ПОЛУЛЄХ ЄВГЕН ЮРІЙОВИЧ",
                "address": "шоссе Стрыйское, 1",
                "latitude": 49.5190499,
                "longitude": 23.9461104,
                "width": 0,
                "height": 0,
                "phones": "(03241) 41105, (03241) 41985(контактная информация)",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "790 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "781 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "546 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "392 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "308 км."
                    }
                ],
                "region": "UA-46",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 47,
                "title": "Добротворская ТЭС",
                "owner": "Ахметов Рінат Леонідович (Dtek Energy B.v.)",
                "person": "ІВАНІШИН СЕРГІЙ ІВАНОВИЧ",
                "address": "ул. Промышленная, 12",
                "latitude": 50.214693,
                "longitude": 24.37651,
                "width": 0,
                "height": 0,
                "phones": "25432164",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "733 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "724 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "489 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "333 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "202 км."
                    }
                ],
                "region": "UA-46",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 48,
                "title": "ДОБРОТВОР-РАЗНОСЕРВИС, ЧП",
                "owner": "Гнидец Игорь Иванович",
                "person": "Гнидец Игорь Иванович",
                "address": "ул. Сагайдачного, 11, к. 16",
                "latitude": 50.201479,
                "longitude": 24.384476,
                "width": 0,
                "height": 0,
                "phones": "(067) 6727778, (050) 5538209 (контакная информация)",
                "railways": 0,
                "destinations": [],
                "region": "UA-46",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 49,
                "title": "«ЮГцемент», ПАО (прекращена в ведомости ЕДРПОУ на 31.08.2020)",
                "owner": "БУЦЦІ С.П.А, ДІКЕРГОФФ ГМБХ, ФІМЕДІ С.П.А",
                "person": "ПЕТРЕНКО ФЕДІР МИКОЛАЙОВИЧ",
                "address": "ул. Промышленная, 9",
                "latitude": 47.1706967,
                "longitude": 31.7586372,
                "width": 0,
                "height": 0,
                "phones": "(0512) 594501",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "745 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "733 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "788 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "914 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1064 км."
                    }
                ],
                "region": "UA-48",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 50,
                "title": "ЦЕМЕНТ, ООО",
                "owner": "КІНЦЕВИЙ БЕНЕФІЦІАРНИЙ ВЛАСНИК ВІДСУТНІЙ, АКЦІЇ ТОРГУЮТЬСЯ НА БІРЖІ.",
                "person": "Моспанок Сергей Игоревич",
                "address": "ул. Хуторская, 70",
                "latitude": 46.534797,
                "longitude": 30.621756,
                "width": 0,
                "height": 0,
                "phones": "(048) 7380972",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "560 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "548 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "656 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "782 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "878 км."
                    }
                ],
                "region": "UA-51",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 51,
                "title": "ТОВ \"АКТИВАТОР\"",
                "owner": "ЖИГІЛЬ ТЕТЯНА МИКОЛАЇВНА, БІЗІН ЮРІЙ ВОЛОДИМИРОВИЧ, РЕДЬКІНА НАТАЛЯ ОЛЕКСІЇВНА, ОСИПА МАКСИМ МИКОЛАЙОВИЧ",
                "person": "ОСИПА МАКСИМ МИКОЛАЙОВИЧ",
                "address": "ул. Ильфа и Петрова, 21, к. 66",
                "latitude": 46.397057,
                "longitude": 30.7134234,
                "width": 0,
                "height": 0,
                "phones": "(048) 7063391",
                "railways": 0,
                "destinations": [],
                "region": "UA-51",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 52,
                "title": "«Волинь-Цемент» (прекращена в ведомости ЕДРПОУ на 31.08.2020)",
                "owner": "БУЦЦІ С.П.А, ДІКЕРГОФФ ГМБХ, ФІМЕДІ С.П.А",
                "person": "ДАВИДЮК ІГОР ОЛЕКСІЙОВИЧ",
                "address": "ул. Шевченка, 1",
                "latitude": 50.5431213,
                "longitude": 26.2551228,
                "width": 0,
                "height": 0,
                "phones": "(03652) 69205",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "550 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "541 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "306 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "152 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "212 км."
                    }
                ],
                "region": "UA-56",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 53,
                "title": "Сумская ТЭЦ",
                "owner": "ШКРІБЛЯК АНАТОЛІЙ ВАСИЛЬОВИЧ (КОМПАНІЯ \"ВАІДА ЕНТЕРПРАЙСІЗ ЛІМІТЕД\")",
                "person": "ВАСЮНІН ДМИТРО ГЕННАДІЙОВИЧ",
                "address": "",
                "latitude": 50.9325,
                "longitude": 34.819167,
                "width": 0,
                "height": 0,
                "phones": "380542787516, 380542786601",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "304 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "375 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "548 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "707 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "864 км."
                    }
                ],
                "region": "UA-59",
                "type": {
                    "id": 1,
                    "name": "ТЭЦ",
                    "color": "#113aa3",
                    "icon": "images/logo.svg"
                }
            },
            {
                "id": 54,
                "title": "ТЕРУКРЦЕМЕНТ",
                "owner": "ГОНЧАР РАЇСА ВОЛОДИМИРІВНА, ЄВСЄЄВ ВОЛОДИМИР ОЛЕКСІЙОВИЧ, ЗУБЦОВ ВЛАДИСЛАВ ВІКТОРОВИЧ",
                "person": "ЄВСЄЄВ ВОЛОДИМИР ОЛЕКСІЙОВИЧ",
                "address": "ул. Сечевых Стрельцов, 42",
                "latitude": 49.093435,
                "longitude": 25.167054,
                "width": 0,
                "height": 0,
                "phones": "(095) 6222222",
                "railways": 0,
                "destinations": [],
                "region": "UA-61",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 55,
                "title": "ВОСТОК ЦЕМЕНТ",
                "owner": "ОЛІЙНИК ДМИТРО ОЛЕКСАНДРОВИЧ (ТОВ \"ОЛ ЦЕМ\")",
                "person": "Тарусина Татьяна Ивановна",
                "address": "ул. Геологическая, 12",
                "latitude": 49.474663,
                "longitude": 36.851481,
                "width": 0,
                "height": 0,
                "phones": "(066) 8350663, 380917542307",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "569 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "640 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "799 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "925 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1078 км."
                    }
                ],
                "region": "UA-63",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 56,
                "title": "Балаклейский цементный завод",
                "owner": "КІНЦЕВИЙ БЕНЕФІЦІАРНИЙ ВЛАСНИК ВІДСУТНІЙ",
                "person": "ГАЙВОРОНСЬКА МАРГАРИТА СЕРАФИМІВНА",
                "address": "станция Янковский",
                "latitude": 49.492829,
                "longitude": 36.749085,
                "width": 0,
                "height": 0,
                "phones": "(057)4962018, (057)4962218",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "569 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "413 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "442 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "568 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "719 км."
                    }
                ],
                "region": "UA-63",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 57,
                "title": "ОЛ ЦЭМ",
                "owner": "ОЛІЙНИК ДМИТРО ОЛЕКСАНДРОВИЧ",
                "person": "РЯДИНСЬКИЙ МИХАЙЛО ПЕТРОВИЧ",
                "address": "ул. Геологическая, 12",
                "latitude": 49.474663,
                "longitude": 36.851481,
                "width": 0,
                "height": 0,
                "phones": "0503052567, 0574923036 (контактная информация)",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "569 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "414 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "441 км.\t"
                    },
                    {
                        "name": "Удрицк",
                        "distance": "567 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "718 км."
                    }
                ],
                "region": "UA-63",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 58,
                "title": "ЕЛАВУС ЛТД",
                "owner": "ХОДЖАНАЗАРОВ ЯГШИГЕЛДІ",
                "person": "ХОДЖАНАЗАРОВ ЯГШИГЕЛДІ",
                "address": "ул. Харьковская, 5",
                "latitude": 49.9343385,
                "longitude": 36.2436416,
                "width": 0,
                "height": 0,
                "phones": "(066) 0380160",
                "railways": 0,
                "destinations": [],
                "region": "UA-63",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 59,
                "title": "ЛУГАНСКИЙ ЦЕМЕНТ, ТОВ \"НЕОСТИЛ\"",
                "owner": "Блинков Максим Викторович",
                "person": "Блинков Максим Викторович",
                "address": "ул. Маяковского, 14",
                "latitude": 50.009748,
                "longitude": 36.243572,
                "width": 0,
                "height": 0,
                "phones": "(06442) 53300",
                "railways": 0,
                "destinations": [],
                "region": "UA-63",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 60,
                "title": "Змиевская ТЭС",
                "owner": "Корчинський Олександр Сигізмундович (ПАТ \"ЦЕНТРЕНЕРГО\")",
                "person": "ПЛОТНІКОВ СЕРГІЙ ІВАНОВИЧ",
                "address": "ул. Циалковского",
                "latitude": 49.585115,
                "longitude": 36.523017,
                "width": 0,
                "height": 0,
                "phones": "80574752487",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "548 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "606 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "765 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "891 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1044 км."
                    }
                ],
                "region": "UA-63",
                "type": {
                    "id": 2,
                    "name": "ТЭС",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 61,
                "title": "Эсхаровская ТЭЦ-2 (В состоянии прекращения)",
                "owner": "МІНЕНЕРГОВУГІЛЛЯ",
                "person": "САПА АНАТОЛІЙ МИКОЛАЙОВИЧ",
                "address": "ул. 152-й Стрелковой Дивизии, 16",
                "latitude": 49.801318,
                "longitude": 36.600144,
                "width": 0,
                "height": 0,
                "phones": "80574630102",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "532 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "603 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "762 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "888 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1041 км."
                    }
                ],
                "region": "UA-63",
                "type": {
                    "id": 1,
                    "name": "ТЭЦ",
                    "color": "#113aa3",
                    "icon": "images/logo.svg"
                }
            },
            {
                "id": 62,
                "title": "ХЕРСОНСКИЙ ЗАВОД СТРОИТЕЛЬНЫХ МАТЕРИАЛОВ И ЖЕЛЕЗОБЕТОННЫХ КОНСТРУКЦИЙ, ТОВ \"ХЗ БМЗК\"",
                "owner": "ЛЕЛЕЧЕНКО НАТАЛІЯ ВІКТОРІВНА, НАДТОЧІЙ ВОЛОДИМР ІВАНОВИЧ, СЕМЕНЮК ВАСИЛЬ ВАСИЛЬОВИЧ",
                "person": "СЕМЕНЮК ВАСИЛЬ ВАСИЛЬОВИЧ",
                "address": "ул. Люксембург, 6",
                "latitude": 46.650128,
                "longitude": 32.590695,
                "width": 0,
                "height": 0,
                "phones": "0993066779 (контактная информация)",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "778 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "766 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "821 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "947 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "1098 км."
                    }
                ],
                "region": "UA-65",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 63,
                "title": "ПОДОЛЬСК-ЦЕМЕНТ",
                "owner": "АКЦІОНЕРИ ЗГІДНО З РЕЄСТРОМ ВЛАСНИКІВ ІМЕННИХ ЦІННИХ ПАПЕРІВ., Розмір внеску до статутного фонду (грн.): 907452000",
                "person": "Маккеон Кевiн Джерард",
                "address": "шоссе Хмельницкое, 1а",
                "latitude": 48.749549,
                "longitude": 26.6047193,
                "width": 0,
                "height": 0,
                "phones": "0384967215",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "690 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "681 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "446 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "498 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "498 км."
                    }
                ],
                "region": "UA-68",
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            },
            {
                "id": 64,
                "title": "Черкасская ТЭЦ",
                "owner": "ПАТ ГОРОДИЩИВСЬКИЙ ЦУКРОВИЙ ЗАВОД",
                "person": "ПИЛЬНОВА  ОЛЕНА ПЕТРІВНА",
                "address": "пр. Химиков, 76",
                "latitude": 49.386111,
                "longitude": 32.060833,
                "width": 0,
                "height": 0,
                "phones": "362191",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "381 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "373 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "477 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "603 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "756 км."
                    }
                ],
                "region": "UA-71",
                "type": {
                    "id": 1,
                    "name": "ТЭЦ",
                    "color": "#113aa3",
                    "icon": "images/logo.svg"
                }
            },
            {
                "id": 65,
                "title": "Черниговская ТЭЦ",
                "owner": "ШКРІБЛЯК АНАТОЛІЙ ВАСИЛЬОВИЧ (ТОВ ФІРМА \"ТЕХНОВА\")",
                "person": "Щербина Олексій Юрійович",
                "address": "ул. Ушинского, 23",
                "latitude": 51.457225,
                "longitude": 31.258346,
                "width": 0,
                "height": 0,
                "phones": "(0462) 69-42-18",
                "railways": 1,
                "destinations": [
                    {
                        "name": "Тереховка",
                        "distance": "143 км."
                    },
                    {
                        "name": "Горностаевка",
                        "distance": "72 км."
                    },
                    {
                        "name": "Словечно",
                        "distance": "307 км."
                    },
                    {
                        "name": "Удрицк",
                        "distance": "466 км."
                    },
                    {
                        "name": "Заболотье",
                        "distance": "698 км."
                    }
                ],
                "region": null,
                "type": {
                    "id": 1,
                    "name": "ТЭЦ",
                    "color": "#113aa3",
                    "icon": "images/logo.svg"
                }
            },
            {
                "id": 66,
                "title": "Ф-БЕТОН",
                "owner": "Ивончак Юрий Васильевич",
                "person": "Ивончак Юрий Васильевич",
                "address": "ул. Руская, 248м",
                "latitude": 48.27213,
                "longitude": 25.987894,
                "width": 0,
                "height": 0,
                "phones": "(0372) 570339",
                "railways": 0,
                "destinations": [],
                "region": null,
                "type": {
                    "id": 3,
                    "name": "Цементный завод",
                    "color": null,
                    "icon": null
                }
            }
        ],
        cities: [
            {
                'id': 0,
                'title': 'Винница',
                'latitude': 49.2335209,
                'longitude': 28.4746833
            },
            {
                'id': 1,
                'title': 'Луцк',
                'latitude': 50.6909429,
                'longitude': 24.8582741
            },
            {
                'id': 2,
                'title': 'Днепр',
                'latitude': 48.4678108,
                'longitude': 35.039993
            },
            {
                'id': 3,
                'title': 'Мариуполь',
                'latitude': 47.0999097,
                'longitude': 37.5505006
            },
            {
                'id': 4,
                'title': 'Житомир',
                'latitude': 50.4070161,
                'longitude': 28.1201125
            },
            {
                'id': 5,
                'title': 'Ужгород',
                'latitude': 48.6193764,
                'longitude': 22.2446183
            },
            {
                'id': 6,
                'title': 'Запорожье',
                'latitude': 47.837166,
                'longitude': 35.1395583
            },
            {
                'id': 7,
                'title': 'Ивано-Франковск',
                'latitude': 48.9196225,
                'longitude': 24.7062728
            },
            {
                'id': 8,
                'title': 'Кропивницкий ',
                'latitude': 48.5187443,
                'longitude': 32.1456237
            },
            {
                'id': 9,
                'title': 'Северодонецк',
                'latitude': 48.9464345,
                'longitude': 38.5259092
            },
            {
                'id': 10,
                'title': 'Львов',
                'latitude': 49.8371101,
                'longitude': 24.0240213
            },
            {
                'id': 11,
                'title': 'Николаев',
                'latitude': 46.9751926,
                'longitude': 31.9938388
            },
            {
                'id': 12,
                'title': 'Одесса',
                'latitude': 46.4869901,
                'longitude': 30.727425
            },
            {
                'id': 13,
                'title': 'Полтава',
                'latitude': 49.6020233,
                'longitude': 34.4871993
            },
            {
                'id': 13,
                'title': 'Ровно',
                'latitude': 50.6195159,
                'longitude': 26.251022
            },
            {
                'id': 14,
                'title': 'Сумы',
                'latitude': 50.9088299,
                'longitude': 34.8033105
            },
            {
                'id': 15,
                'title': 'Тернополь',
                'latitude': 49.5578377,
                'longitude': 25.6322048
            },
            {
                'id': 16,
                'title': 'Харьков',
                'latitude': 50.0010942,
                'longitude': 36.238456
            },
            {
                'id': 17,
                'title': 'Херсон',
                'latitude': 46.6388664,
                'longitude': 32.6141072
            },
            {
                'id': 18,
                'title': 'Хмельницкий',
                'latitude': 49.4208828,
                'longitude': 26.9924701
            },
            {
                'id': 19,
                'title': 'Черкассы',
                'latitude': 49.4447982,
                'longitude': 32.058461
            },
            {
                'id': 20,
                'title': 'Чернигов',
                'latitude': 51.494139,
                'longitude': 31.2927039
            },
            {
                'id': 21,
                'title': 'Черновцы',
                'latitude': 48.2937359,
                'longitude': 25.9353084
            },
            {
                'id': 22,
                'title': 'Киев',
                'latitude': 50.4498407,
                'longitude': 30.5216584
            },
        ]
    }
}

const state = defaultState();

const getters = {
    getObjects: state => state.objects,
    getTypes: state => state.types,
    getCities: state => state.cities
}

export default {
    state,
    getters
};


